<?php
return array (
	'user'	=>
			[
				'duplicate'		=>	'Не возможно создать пользователя. Найдены дубликаты в системе. Имя пользователя должно быть уникальным',
				'aut'			=>	'Ошибка авторизации, вы уже авторизованы!!! Для переавторизации необходимо разлогиниться и повторить попытку!',
				'true'			=>	'Заявка на добавление пользователя успешно принята',
				'session'		=>	'Данный портал не сможет работать без поддержки сессиий!',
				'DB'			=>	'Данный пользователь не существует',
				'UserFine'		=>	'Успешная авторизация',
				'UserNot'		=>	'Неправильно задан логин/пароль',
			],    
	);