<?php
return array (
	'uri'	=> [											//системные
		'controller' 	=>	'/^[a-zA-Z0-9+_\-]{2,20}$/',
		'action' 		  =>	'/^[a-zA-Z0-9+_\-]{2,20}$/',
		'id' 			    =>	'/^[a-zA-Z0-9+_\-\:\?\=\/]{1,40}$/'
	],
	'user' => [												//пользовательские
		'login' 		  =>	'/^[a-zA-Z0-9_-]{3,16}$/',
		'password'		=>	'/^[a-zA-Z0-9_-]{3,18}$/',
	],
	'base' => [
		'price'			  =>	'/^\d{1,20}\.{0,1}\d{0,2}$/',           	//цена
		'floor'       =>  '/^\d{1,5}$/',                          			//этаэ, этажность
		'hesh'        =>  '/^[0-9a-z]{31,33}$/',                  			//хэш uid-а хранящегося в базе
		'nd'          =>  '/^\d{1,10}([0-9a-zA-Zа-яА-Я\-\/]|\ ){1,8}$/u', 	//номер дома
		'tch'         =>  '/^\d{1,3}$/'                           			//тип помещения

	],
	'help' => [
		'inputCity'		=>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputArea'		=>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputStreet'	=>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputS'	  	=>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputN'		  =>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputM'		  =>	'/^([0-9A-Za-zА-Яа-я_-]|\ ){2,30}$/u',
		'inputKey'		=>	'/^\d{1}$/u'
	]
);